app/controllers/accounts_controller.rb

SELECT * FROM `accounts`
---
 def index
  @accounts = Account.all

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
  def show
  @account = Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 2)
---
  def edit
    @account = Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 2)
UPDATE `accounts` SET `updated_at` = '2010-03-04 09:45:28', `account_number` = '221' WHERE `id` = 2
---
  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])

INSERT INTO `accounts` (`created_at`, `updated_at`, `supplier_id`, `account_number`) VALUES('2010-03-04 09:43:52', '2010-03-04 09:43:52', NULL, '22222')
---
  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save