app/controllers/suppliers_controller.rb

  def index
  @suppliers = Supplier.all
---
SELECT * FROM `suppliers`

  def show
  @supplier = Supplier.find(params[:id])
---
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)

  def update
    @supplier = Supplier.find(params[:id])
---
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 1)

  def create
    @supplier = Supplier.new(params[:supplier])

    respond_to do |format|
      if @supplier.save
---
INSERT INTO `suppliers` (`name`, `created_at`, `updated_at`) VALUES('Socialwalk', '2010-03-04 13:59:44', '2010-03-04 13:59:44')